In [2]:
import pandas as pd

In [8]:
filePath = 'airqualityuci.csv'
df = pd.read_csv(
        filePath,delimiter=";"
        ,parse_dates=["Date","Time"]
        ,infer_datetime_format=True
        ,dayfirst=True
        #,skip_blank_lines=True
        ,decimal=","
        )
     
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9471 entries, 0 to 9470
Data columns (total 17 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           9357 non-null   datetime64[ns]
 1   Time           9357 non-null   object
 2   CO(GT)         9357 non-null   float64
 3   PT08.S1(CO)    9357 non-null   float64
 4   NMHC(GT)       9357 non-null   float64
 5   C6H6(GT)       9357 non-null   float64
 6   PT08.S2(NMHC)  9357 non-null   float64
 7   NOx(GT)        9357 non-null   float64
 8   PT08.S3(NOx)   9357 non-null   float64
 9   NO2(GT)        9357 non-null   float64
 10  PT08.S4(NO2)   9357 non-null   float64
 11  PT08.S5(O3)    9357 non-null   float64
 12  T              9357 non-null   float64
 13  RH             9357 non-null   float64
 14  AH             9357 non-null   float64
 15  Unnamed: 15    0 non-null      float64
 16  Unnamed: 16    0 non-null      float64
dtypes: datetime64[ns](1), float64(15), object(1)
memory usage: 1.2+ MB

In [7]:
df.head()

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH,Unnamed: 15,Unnamed: 16
0,2004-03-10,18.00.00,2.6,1360.0,150.0,11.9,1046.0,166.0,1056.0,113.0,1692.0,1268.0,13.6,48.9,0.7578,NaN,NaN
1,2004-03-10,19.00.00,2.0,1292.0,112.0,9.4,955.0,103.0,1174.0,92.0,1559.0,972.0,13.3,47.7,0.7255,NaN,NaN
2,2004-03-10,20.00.00,2.2,1402.0,88.0,9.0,939.0,131.0,1140.0,114.0,1555.0,1074.0,11.9,54.0,0.7502,NaN,NaN
3,2004-03-10,21.00.00,2.2,1376.0,80.0,9.2,948.0,172.0,1092.0,122.0,1584.0,1203.0,11.0,60.0,0.7867,NaN,NaN
4,2004-03-10,22.00.00,1.6,1272.0,51.0,6.5,836.0,131.0,1205.0,116.0,1490.0,1110.0,11.2,59.6,0.7888,NaN,NaN

In [6]:
df = df.dropna(how='all')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9357 entries, 0 to 9356
Data columns (total 17 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           9357 non-null   datetime64[ns]
 1   Time           9357 non-null   object
 2   CO(GT)         9357 non-null   float64
 3   PT08.S1(CO)    9357 non-null   float64
 4   NMHC(GT)       9357 non-null   float64
 5   C6H6(GT)       9357 non-null   float64
 6   PT08.S2(NMHC)  9357 non-null   float64
 7   NOx(GT)        9357 non-null   float64
 8   PT08.S3(NOx)   9357 non-null   float64
 9   NO2(GT)        9357 non-null   float64
 10  PT08.S4(NO2)   9357 non-null   float64
 11  PT08.S5(O3)    9357 non-null   float64
 12  T              9357 non-null   float64
 13  RH             9357 non-null   float64
 14  AH             9357 non-null   float64
 15  Unnamed: 15    0 non-null      float64
 16  Unnamed: 16    0 non-null      float64
dtypes: datetime64[ns](1), float64(15), object(1)
memory usage: 1.3+ MB

In [9]:
df = df.dropna(axis='columns',how='all')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9471 entries, 0 to 9470
Data columns (total 15 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           9357 non-null   datetime64[ns]
 1   Time           9357 non-null   object
 2   CO(GT)         9357 non-null   float64
 3   PT08.S1(CO)    9357 non-null   float64
 4   NMHC(GT)       9357 non-null   float64
 5   C6H6(GT)       9357 non-null   float64
 6   PT08.S2(NMHC)  9357 non-null   float64
 7   NOx(GT)        9357 non-null   float64
 8   PT08.S3(NOx)   9357 non-null   float64
 9   NO2(GT)        9357 non-null   float64
 10  PT08.S4(NO2)   9357 non-null   float64
 11  PT08.S5(O3)    9357 non-null   float64
 12  T              9357 non-null   float64
 13  RH             9357 non-null   float64
 14  AH             9357 non-null   float64
dtypes: datetime64[ns](1), float64(13), object(1)
memory usage: 1.1+ MB

In [10]:
df.isnull().sum()

Date              114
Time              114
CO(GT)            114
PT08.S1(CO)       114
NMHC(GT)          114
C6H6(GT)          114
PT08.S2(NMHC)     114
NOx(GT)           114
PT08.S3(NOx)      114
NO2(GT)           114
PT08.S4(NO2)      114
PT08.S5(O3)       114
T                 114
RH                114
AH                114
Unnamed: 15      9471
Unnamed: 16      9471
dtype: int64

In [ ]:
df.drop(‘cabin', axis=1, inplace=True)

In [3]:
filePath = 'airqualityuci.xlsx'
dfx = pd.read_excel(
        filePath
        ,thousands=","
        )
  
dfx.dtypes

Date             datetime64[ns]
Time                     object
CO(GT)                  float64
PT08.S1(CO)             float64
NMHC(GT)                  int64
C6H6(GT)                float64
PT08.S2(NMHC)           float64
NOx(GT)                 float64
PT08.S3(NOx)            float64
NO2(GT)                 float64
PT08.S4(NO2)            float64
PT08.S5(O3)             float64
T                       float64
RH                      float64
AH                      float64
dtype: object

In [16]:
filePath = 'airqualityuci by year.xlsx'
dfx = pd.read_excel(
        filePath
        ,sheet_name=None
        ,thousands=","
        )
  
#dfx.dtypes

AttributeError: 'dict' object has no attribute 'dtypes'

In [ ]:
list(dfx)[0]

In [19]:
#dfx['2004']

TypeError: 'dict' object is not callable

In [13]:
#dfx2 = pd.concat(pd.read_excel(filePath, sheet_name=None), ignore_index=True)
dfx2 = pd.read_excel(filePath, sheet_name=None)
dfx2

{'2004':            Date      Time  CO(GT)  PT08.S1(CO)  NMHC(GT)   C6H6(GT)  \
 0    2004-03-10  18:00:00     2.6      1360.00       150  11.881723
 1    2004-03-10  19:00:00     2.0      1292.25       112   9.397165
 2    2004-03-10  20:00:00     2.2      1402.00        88   8.997817
 3    2004-03-10  21:00:00     2.2      1375.50        80   9.228796
 4    2004-03-10  22:00:00     1.6      1272.25        51   6.518224
 ...         ...       ...     ...          ...       ...        ...
 7105 2004-12-31  19:00:00  -200.0       929.50      -200   5.344026
 7106 2004-12-31  20:00:00  -200.0       962.00      -200   5.338917
 7107 2004-12-31  21:00:00  -200.0       974.25      -200   5.544912
 7108 2004-12-31  22:00:00  -200.0      1054.75      -200   5.565694
 7109 2004-12-31  23:00:00  -200.0      1002.50      -200   4.620274

       PT08.S2(NMHC)  NOx(GT)  PT08.S3(NOx)  NO2(GT)  PT08.S4(NO2)  \
 0           1045.50      166       1056.25      113       1692.00
 1            954.75      103       1173.75       92       1558.75
 2            939.25      131       1140.00      114       1554.50
 3            948.25      172       1092.00      122       1583.75
 4            835.50      131       1205.00      116       1490.00
 ...             ...      ...           ...      ...           ...
 7105         780.50     -200        933.25     -200        906.25
 7106         780.25     -200        919.25     -200        908.50
 7107         790.25     -200        914.75     -200        895.25
 7108         791.25     -200        844.50     -200        936.00
 7109         744.00     -200        882.00     -200        899.00

       PT08.S5(O3)       T         RH        AH
 0         1267.50  13.600  48.875001  0.757754
 1          972.25  13.300  47.700000  0.725487
 2         1074.00  11.900  53.975000  0.750239
 3         1203.25  11.000  60.000000  0.786713
 4         1110.00  11.150  59.575001  0.788794
 ...           ...     ...        ...       ...
 7105       866.25   9.350  33.625000  0.395774
 7106       883.50   9.625  32.300000  0.387114
 7107       950.75   9.125  32.475000  0.376616
 7108      1195.25   9.100  37.225000  0.430991
 7109      1137.75   7.800  38.450000  0.408451

 [7110 rows x 15 columns],
 '2005':            Date      Time  CO(GT)  PT08.S1(CO)  NMHC(GT)   C6H6(GT)  \
 0    2005-01-01  00:00:00  -200.0      1046.25      -200   4.247511
 1    2005-01-01  01:00:00     1.6      1274.50      -200   8.763027
 2    2005-01-01  02:00:00     2.5      1172.75      -200   7.498693
 3    2005-01-01  03:00:00     2.7      1162.50      -200   7.563761
 4    2005-01-01  04:00:00     1.9      1054.00      -200   5.560496
 ...         ...       ...     ...          ...       ...        ...
 2242 2005-04-04  10:00:00     3.1      1314.25      -200  13.529605
 2243 2005-04-04  11:00:00     2.4      1162.50      -200  11.355157
 2244 2005-04-04  12:00:00     2.4      1142.00      -200  12.374538
 2245 2005-04-04  13:00:00     2.1      1002.50      -200   9.547187
 2246 2005-04-04  14:00:00     2.2      1070.75      -200  11.932060

       PT08.S2(NMHC)  NOx(GT)  PT08.S3(NOx)  NO2(GT)  PT08.S4(NO2)  \
 0            724.25   -200.0        848.00   -200.0        897.75
 1            930.00    214.9        648.50    106.3       1023.50
 2            878.25    299.8        738.00    128.6       1002.00
 3            881.00   -200.0        748.25   -200.0       1001.25
 4            791.00    253.1        829.50    126.0        966.50
 ...             ...      ...           ...      ...           ...
 2242        1101.25    471.7        538.50    189.8       1374.25
 2243        1027.00    353.3        603.75    179.2       1263.50
 2244        1062.50    293.0        603.25    174.7       1240.75
 2245         960.50    234.5        701.50    155.7       1041.00
 2246        1047.25    265.2        654.00    167.7       1128.50

       PT08.S5(O3)       T         RH        AH
 0         1201.25   8.200  40.099999  0.437451
 1         1617.00   5.325  50.725000  0.456368
 2         1355.25   5.925  50.049999  0.468928
 3         1295.50   4.850  53.875000  0.469339
 4         1131.00   4.325  55.325000  0.465048
 ...           ...     ...        ...       ...
 2242      1728.50  21.850  29.250000  0.756824
 2243      1269.00  24.325  23.725000  0.711864
 2244      1092.00  26.900  18.350000  0.640649
 2245       769.75  28.325  13.550000  0.513866
 2246       816.00  28.500  13.125000  0.502804

 [2247 rows x 15 columns]}

In [23]:
filePath = 'airqualityuci by year.xlsx'
excel_file = pd.ExcelFile.Parse(filePath)
excel_file
df1 = excel_file.parse('2004') # read a specific sheet into a pandas DataFrame
df2 = excel_file.parse('2005') # read another sheet into a pandas DataFrame
df2
excel_file.close()

AttributeError: type object 'ExcelFile' has no attribute 'Parse'

In [29]:
import mysql.connector
# create a connection object to the database
cnx = mysql.connector.connect(user='root', password='password', database='sakila')

# write a SQL query to select all data from the actor table and sort it by the actor's last name in descending order
query = "SELECT * FROM actor ORDER BY last_name DESC"

# use the pandas read_sql method to execute the query and return the result as a pandas dataframe
df = pd.read_sql(query, cnx)

# print the dataframe
#print(df.head())

C:\Users\Edgar\AppData\Local\Temp\ipykernel_18688\405760524.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, cnx)

In [1]:
#%%timeit -n 3 -r 1
import pandas as pd
#import mysql.connector
from sqlalchemy import create_engine
# create a connection object to the database
#cnx = mysql.connector.connect('mysql+mysqlconnector://root:password@localhost:3306/sakila')

# create a dictionary of connection parameters
connection_params = {
    'host': 'localhost',
    'user': 'root',
    'password': 'password',
    'database': 'sakila'
}

# create a SQLAlchemy engine using the connection parameters dictionary
engine = create_engine('mysql+mysqlconnector://', connect_args=connection_params)

# write a SQL query to select all data from the actor table and sort it by the actor's last name in descending order
query = "SELECT * FROM actor ORDER BY last_name DESC"

# use the pandas read_sql method to execute the query and return the result as a pandas dataframe
df = pd.read_sql(query, con=engine)

# print the dataframe
print(df.head())

   actor_id first_name  last_name         last_update
0        85     MINNIE  ZELLWEGER 2006-02-15 04:34:33
1       111    CAMERON  ZELLWEGER 2006-02-15 04:34:33
2       186      JULIA  ZELLWEGER 2006-02-15 04:34:33
3        63    CAMERON       WRAY 2006-02-15 04:34:33
4        13        UMA       WOOD 2006-02-15 04:34:33

In [36]:
%%timeit
import pandas as pd
from sqlalchemy import create_engine

# create an engine object using the mysql-connector-python library
#engine = create_engine('mysql+mysqlconnector://user:password@host:port/database')
engine = create_engine('mysql+mysqlconnector://root:password@localhost:3306/sakila')

# execute a query and load the results into a pandas DataFrame
#query = 'SELECT * FROM my_table'
query = "SELECT * FROM actor ORDER BY last_name DESC"
df = pd.read_sql(query, engine)
df

29.6 ms ± 6.16 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [37]:
df

     actor_id first_name  last_name         last_update
0          85     MINNIE  ZELLWEGER 2006-02-15 04:34:33
1         111    CAMERON  ZELLWEGER 2006-02-15 04:34:33
2         186      JULIA  ZELLWEGER 2006-02-15 04:34:33
3          63    CAMERON       WRAY 2006-02-15 04:34:33
4          13        UMA       WOOD 2006-02-15 04:34:33
..        ...        ...        ...                 ...
195       145        KIM      ALLEN 2006-02-15 04:34:33
196       194      MERYL      ALLEN 2006-02-15 04:34:33
197        58  CHRISTIAN     AKROYD 2006-02-15 04:34:33
198        92    KIRSTEN     AKROYD 2006-02-15 04:34:33
199       182     DEBBIE     AKROYD 2006-02-15 04:34:33

[200 rows x 4 columns]

In [2]:
import mysql.connector
from sqlalchemy import create_engine
import pandas as pd

# create a dictionary of connection parameters
connection_params = {
    'host': 'localhost',
    'user': 'root',
    'password': 'password',
    'database': 'sakila'
}
# create a SQLAlchemy engine using the connection parameters dictionary
engine = create_engine('mysql+mysqlconnector://', connect_args=connection_params)

# write a SQL query to select all data from the actor table and sort it by the actor's last name in descending order
query = "SELECT * FROM actor ORDER BY last_name DESC"

# use the pandas read_sql method to execute the query and return the result as a pandas dataframe
df = pd.read_sql(query, con=engine)

# print the dataframe
print(df.head())

   actor_id first_name  last_name         last_update
0        85     MINNIE  ZELLWEGER 2006-02-15 04:34:33
1       111    CAMERON  ZELLWEGER 2006-02-15 04:34:33
2       186      JULIA  ZELLWEGER 2006-02-15 04:34:33
3        63    CAMERON       WRAY 2006-02-15 04:34:33
4        13        UMA       WOOD 2006-02-15 04:34:33

In [10]:
import pandas as pd
import numpy as np

# Create a sample series with empty values
s = pd.Series([1, 2, np.nan, 4, np.nan, 6])

print(s)

# Replace empty values with the mean of non-empty values
s.fillna(s.mean(), inplace=True)

print(s)

0    1.0
1    2.0
2    NaN
3    4.0
4    NaN
5    6.0
dtype: float64
0    1.00
1    2.00
2    3.25
3    4.00
4    3.25
5    6.00
dtype: float64